<?php
require_once ('DB_CLASS.php');
require_once ('DOCUMENT_CLASS.php');
require_once ('SHOP_CLASS.php');
require_once ('CARD_CLASS.php');
require_once ('DB_INFO.php');

$DB = new DB();
$DB->DB_CONNECT($db_info);

//-----------------------------------------------------------------------------------------------------------------------------
// ИСПОЛЬЗОВАНИЕ КЛАССА КАРТ. ДЛЯ КАРТЫ "2311200000140", КОТОРАЯ ИСПОЛЬЗУЕТСЯ КАК СЕРТИФИКАТ 
	
$card = new CARD();
$card->PREFIX_LENGTH = 5;

$card->NUMBER = "2311200000140";

$DOCS_ARRAY = array();
$DOCS_ARRAY = $card->GET_DOCS($DB);
var_dump($DOCS_ARRAY);

for($i=0; $i < count($DOCS_ARRAY); $i++)
	{
	    echo "************************************** № ДОКУМЕНТА => ".$DOCS_ARRAY[$i]." ***********************************";
		$test = new DOCUMENT();
		$test->ID = $DOCS_ARRAY[$i];
		$cards = $test->GET_CARDS($DB);
		var_dump ($cards);							// СПИСОК КАРТ ДОКУМЕНТА
		var_dump ($test->GET_ITEMS($DB));  // СПИСОК ПОЗИЦИЙ ДОКУМЕНТА
		var_dump ($test->GET_PAYS($DB));    // СПИСОК ПЛАТЕЖЕЙ ДОКУМЕНТА
		echo "</BR>";
	}

$counter = new CARD_COUNTER($DB,$card->NUMBER);
echo "</BR>";
echo "</BR>";
print_r($counter->GET_COUNTER($DB));

$DB->CLEAR_DATASET();
/*
//------------------------------------------------------------------------------------------------------------------------
echo "**************************************ПРИМЕР РАБОТЫ С КАРТАМИ И СЧЕТЧИКАМИ***********************************";

$DB->query = "SELECT * FROM CCARD WHERE CCARD.VAL >= '2311300000000' AND CCARD.VAL <= '2311400000000'"; // ВЫБОР КАРТ С ОПРЕДЕЛЕННЫМ КОДОМ 
$DB->QUERY();

$SERTS = $DB->MAKE_ARRAY("VAL");
for($i=0; $i < count($SERTS); $i++)
	{
		$card_counter = new CARD_COUNTER($DB,$SERTS[$i]); // ПОЛУЧЕНИЕ 
		$result = $card_counter->GET_COUNTER($DB);		  // СЧЕТЧИКОВ КАРТ
	}
	
	
//-----------------------------------------------------------------------------------------------------------------------------
// ПОДСЧЕТ СТАТИСТИКИ ПО МАГАЗИНУ С КОДОМ МЕСТА '5' (RMK.CODE номер рабочего места в консоли администрирования FRONTOL)
	
$shop = new SHOP();
$shop->SET(5);

$SHOP_STAT = $shop->GET_STAT($DB, "20.11.2013", "20.11.2013");
var_dump($SHOP_STAT);

//-----------------------------------------------------------------------------------------------------------------------------
// ВЫВОД ДАННЫХ О МАГАЗИНЕ С КОДОМ МЕСТА '3' (RMK.CODE номер рабочего места в консоли администрирования FRONTOL)

$shop = new SHOP();
$shop->NUMBER = 3;

$shop_arr = $shop->GET_NAME($DB);
print_r ($shop_arr);
echo $shop_arr[0]["TEXT"];

//-----------------------------------------------------------------------------------------------------------------------------
// ВЫВОД ДАННЫХ О СРЕДНЕМ ЧЕКЕ МАГАЗИНОВ С КОДОМ МЕСТА ОТ '2' ДО '10' (RMK.CODE номер рабочего места в консоли администрирования FRONTOL)
// ПРИ УСЛОВИИ, ЧТО ИСПОЛЬЗУЕТСЯ СИНХРОНИЗАЦИЯ КОЛ-ВО МАГАЗИНОВ("РАБОЧИХ МЕСТ", БДО) МОЖЕТ БЫТЬ БОЛЬШЕ 1 В БДС (БДС - центр. база в терминологии FRONTOL)  

$range = array(0,100,200,300,400,500,700,1000,1500,2000,3000,9999999); //ДИАПАЗОНЫ ДЛЯ ВЫБОРКИ КОЛ-ВА ЧЕКОВ 
for ($i = 2; $i < 10; $i++)
	{
		$SHOP->SET($i);
		print_r($SHOP->AVG_CHECK($DB,"01.04.2012","30.04.2013", $range));
		echo "</BR>";
	}	*/
?>
